# Pydataset 설치
* pip install pydataset

In [1]:
!pip install pydataset

Requirement already satisfied: pydataset in c:\users\c4022\anaconda3\lib\site-packages (0.2.0)
Requirement already satisfied: pandas in c:\users\c4022\anaconda3\lib\site-packages (from pydataset) (1.3.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\c4022\anaconda3\lib\site-packages (from pandas->pydataset) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\c4022\anaconda3\lib\site-packages (from pandas->pydataset) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\users\c4022\anaconda3\lib\site-packages (from pandas->pydataset) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\users\c4022\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas->pydataset) (1.16.0)

In [3]:
# 패키지 가져오기
import pydataset as pds

# Dataset

In [4]:
# check the data
pds.data() # In the pydataset there are 757 datsets.

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [5]:
# create variable
data = pds.data()

# check the top 5 datasets
data.head()

      dataset_id                                        title
0  AirPassengers  Monthly Airline Passenger Numbers 1949-1960
1        BJsales            Sales Data with Leading Indicator
2            BOD                    Biochemical Oxygen Demand
3   Formaldehyde                Determination of Formaldehyde
4   HairEyeColor    Hair and Eye Color of Statistics Students

# Find the data
* try to find the dataset_id is `mtcars`

In [6]:
# Answer
data[data['dataset_id']=='mtcars']

   dataset_id                       title
47     mtcars  Motor Trend Car Road Tests

In [13]:
# save the variable
df = pds.data('mtcars')
df.head(1) # check the data top 1

            mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [9]:
# check the size of data
df.shape # colmns = 11, and lows = 32

(32, 11)

In [12]:
# check the info of data
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32 entries, Mazda RX4 to Volvo 142E
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 3.0+ KB

In [14]:
# check the values of columan which name is 'am'
df['am'].value_counts()

0    19
1    13
Name: am, dtype: int64

* find the data that columns 'am' is 0 and 'gear' is 4

In [16]:
# answer
ans = df[(df['am'] == 0) & (df['gear'] ==4)] # take care of parentheses

In [18]:
# check the count
len(ans) # four

4